app/controllers/apps4all_controller.rb

SELECT `apps4alls`.* FROM `apps4alls`
---
  def index
    @posts = Apps4all.all